# 3. Parse wikitext yourself
# You can use the query API to get the page's wikitext, parse it using mwparserfromhell (install it first using pip install mwparserfromhell), then reduce it down to human-readable text using strip_code. strip_code doesn't work perfectly at the time of writing (as shown clearly in the example below) but will hopefully improve.
import requests
import mwparserfromhell

#categories = ['فیزیک', 'ریاضیات', 'سلامت', 'تاریخ', 'فناوری']
categories = ['فناوری']
topics = dict()
topics['فیزیک'] = ['ترمودینامیک کلاسیک', 'دینامیک سیالات محاسباتی', 'گشتاور مغناطیسی', 'مدار مغناطیسی', 'نظریه ریسمان',
                   'مکانیک آماری', 'فیزیک', 'آزمایش کاوندیش', 'ماده تاریک', 'نظریه وحدت بزرگ', 'ذرات زیراتمی',
                   'پادماده', 'آلبرت اینشتین', 'ریچارد فاینمن', 'قوانین حرکت نیوتن', 'آینه خمیده', 'عدسی', 'مکانیک',
                   'مکانیک کلاسیک', 'مکانیک کوانتومی', 'اصل عدم قطعیت', 'نظریه میدان‌های کوانتومی', 'ماشین گرمایی',
                   'الکترومغناطیس', 'الکترواستاتیک', 'بار الکتریکی', 'شار', 'ولتاژ', 'معادلات ماکسول',
                   'معادله بولتسمان', 'اصطکاک', 'مرکز جرم', 'معادله برنولی', 'استاتیک', 'تکانه زاویه‌ای', 'شتاب',
                   'برخورد', 'تکانه', 'نسبیت خاص', 'نسبیت عام', 'هم‌ارزی جرم و انرژی', 'سینماتیک', 'دینامیک',
                   'سرعت نور', 'شکل‌دهی الکترومغناطیسی', 'سیال الکترورئولوژیک', 'بلز پاسکال', 'میدان مغناطیسی',
                   'میدان الکتریکی', 'انرژی', 'نیرو', 'آیزاک نیوتن', 'رایانش کوانتومی', 'فوتونیک', 'معادله شرودینگر']

topics['ریاضیات'] = ['ریاضیات', 'آمار', 'چندجمله‌ای', 'جبر خطی', 'آنالیز عددی', 'روش مونت‌کارلو', 'تابع مولد', 'تابع',
                     'حد (ریاضی)', 'تابع پیوسته', 'انتگرال', 'تبدیل فوریه گسسته', 'تبدیل فوریه سریع', 'الگوریتم',
                     'نرخ همگرایی', 'ارقام معنی‌دار', 'معادله', 'اتحاد و تجزیه', 'عدد جبری', 'عدد', 'مشتق',
                     'بهینه‌سازی', 'رگرسیون خطی', 'متغیر وابسته و مستقل', 'مدل ریاضیاتی', 'نظریه احتمالات',
                     'متغیر تصادفی', 'متغیر تصادفی مستقل', 'نظریه اعداد', 'نظریه جبری اعداد', 'عدد گویا',
                     'مجموعه (ریاضیات)', 'بستار (ریاضی)', 'مجموعه‌های فازی', 'قضیه کانتور', 'معادله دیفرانسیل',
                     'هندسه اقلیدسی', 'هندسه نااقلیدسی', 'مقدارویژه و بردارویژه', 'گراف (ریاضی)', 'نظریه گراف',
                     'عدد مختلط', 'توپولوژی', 'توابع معکوس مثلثاتی', 'توابع مثلثاتی', 'تبدیل لاپلاس',
                     'تابع چگالی احتمال', 'کانولوشن', 'دستگاه مختصات قطبی', 'دیورژانس', 'قواعد مشتق‌گیری',
                     'سری (ریاضیات)', 'دنباله', 'بی‌نهایت', 'ماتریس']

topics['سلامت'] = ['آمادگی جسمانی', 'هماهنگی حرکتی', 'انعطاف‌پذیری مفصل', 'آموزش پزشکی', 'بهداشت عمومی',
                   'بهداشت عمومی دهان و دندان', 'بهداشت محیط', 'سازمان جهانی بهداشت', 'سوءتغذیه', 'سوءمصرف',
                   'خوراک انسان', 'بیماری‌های غیر واگیر', 'اثرات بلند مدت مصرف الکل', 'تأثیر الکل بر سلامتی',
                   'آنفلوانزای اسپانیایی', 'ویروس', 'رژیم غذایی بر پایه هرم غذایی', 'سلامت', 'سبک زندگی',
                   'خام‌گیاه‌خواری', 'هرم غذایی', 'چاقی', 'رژیم لاغری', 'ویتامین', 'بیماری', 'همه‌گیری', 'پزشکی',
                   'سرطان', 'تومور مغزی', 'پیری', 'امنیت غذایی', 'تمرین بدنی', 'تغذیه', 'سوءهاضمه',
                   'فاصله‌گذاری اجتماعی', 'شستن دست‌ها', 'کروناویروس', 'واکسن', 'بیمارستان', 'اتاق عمل',
                   'پزشک', 'درمان', 'پرستار', 'جراحی', 'عفونت', 'درد', 'دستگاه گردش خون', 'دستگاه گوارش انسان',
                   'بدن انسان', 'دستگاه عصبی', 'افسردگی (حالت)', 'روان‌پزشکی', 'اختلال دوقطبی', 'بیهوشی', 'دارو']

topics['تاریخ'] = ['تاریخ', 'تاریخ ایران باستان', 'جام جم', 'آتش بهرام', 'کوروش بزرگ', 'اسکندر مقدونی', 'داریوش سوم',
                   'شاهنشاهی هخامنشی', 'شاهنشاهی ایران', 'پادشاهی ماد', 'شاهنشاهی اشکانی', 'شاهنشاهی ساسانی',
                   'ایران صفوی', 'افشاریان', 'ایران قاجاری', 'زندیان', 'انقلاب ۱۳۵۷', 'رضاشاه', 'داریوش بزرگ',
                   'کریم‌خان زند', 'جمشید', 'تاریخ بیهقی', 'سامانیان', 'صفاریان', 'طاهریان', 'حمله اعراب به ایران',
                   'نبرد گوگمل', 'حمله مغول به ایران', 'خوارزمشاهیان', 'ایلخانان', 'امپراتوری سلجوقی', 'غزنویان',
                   'خلافت اموی', 'خلافت عباسی', 'خلافت راشدین', 'امپراتوری سلوکی', 'ایلام (تمدن)', 'جنگ جهانی اول',
                   'جنگ جهانی دوم', 'محمدرضا پهلوی', 'یزدگرد سوم', 'خسرو پرویز', 'ناصرالدین‌شاه', 'انقلاب مشروطه',
                   'استبداد صغیر', 'امیرکبیر', 'آدولف هیتلر', 'ولادیمیر لنین', 'بنیتو موسولینی', 'هولوکاست',
                   'ژوزف استالین', 'نهضت ملی‌شدن نفت', 'کودتای ۲۸ مرداد', 'تظاهرات ۱۵ خرداد', 'جنگ چالدران']

topics['فناوری'] = ['اینترنت', 'رایانه', 'تلفن هوشمند', 'سیستم‌عامل موبایل', 'سیستم‌عامل', 'سخت‌افزار رایانه',
                    'امنیت رایانه', 'صنعت خودروسازی', 'ابرشرکت اورکل', 'ایسوس', 'اپل', 'استیو جابز', 'مایکروسافت',
                    'آمازون (شرکت)', 'گوگل', 'اندروید', 'هسته لینوکس', 'ابررایانه', 'آی‌بی‌ام', 'سرور (رایانه)',
                    'اینتل', 'رایانه شخصی', 'مایکروسافت ویندوز', 'مکینتاش', 'بدافزار', 'جاسوس‌افزار', 'نمایشگر رایانه',
                    'برنامه (رایانه)', 'زبان برنامه‌نویسی', 'کامپایلر', 'کد ماشین', 'واحد پردازش مرکزی', 'مدار مجتمع',
                    'جاوا اسکریپت', 'برنامه‌نویسی شیءگرا', 'جاوا (زبان برنامه‌نویسی)', 'C++', 'زبان اسمبلی',
                    'معماری رایانه', 'برنامه‌نویسی رایانه‌ای', 'آی‌اواس', 'آیفون', 'لینوکس', 'یونیکس',
                    'سی (زبان برنامه‌نویسی)', 'حافظه دسترسی تصادفی', 'حافظه (رایانه)', 'درایو دیسک سخت',
                    'صفحه‌بندی (رایانه)', 'موتور جستجوی وب', 'بهینه‌سازی موتور جستجو', 'بازیابی اطلاعات',
                    'پایگاه داده', 'فناوری اطلاعات', 'پردازش اطلاعات']

for category in categories:
    for topic in topics[category]:
        response = requests.get(
            'https://fa.wikipedia.org/w/api.php',
            params={
                'action': 'query',
                'format': 'json',
                'titles': topic,
                'prop': 'revisions',
                'rvprop': 'content'
            }
        ).json()
        page = next(iter(response['query']['pages'].values()))
        wikicode = page['revisions'][0]['*']
        parsed_wikicode = mwparserfromhell.parse(wikicode)
        f = open(category + "/" + topic + ".txt", "w", encoding='utf-8')
        f.write(parsed_wikicode.strip_code())
        f.close()
        #print(parsed_wikicode.strip_code())
